<?php
/**
 * IP转int问题
 * ----------------------------------------------------------------------------------------
 * php中将IP转换成整型的函数ip2long（）容易出现问题，在IP比较大的情况下，会变成负数。
 * ----------------------------------------------------------------------------------------
 *
 * @author boxcore
 * @var string
 */
echo ip2long('127.255.255.255'); // 2147483647 = 十进制的最大值
echo "\n";
echo ip2long('255.255.255.255'); // -1
echo "\n";
echo ip2long('255.255.255.254'); // -2
echo "\n";
echo ip2long('192.168.1.2'); // -1062731518
echo "\n----------------------------------------------\n";

/* 一些正确的处理方法 */
$ip = '192.168.15.90';
echo ip2long($ip); // 32位的php运行输出(-1062727846), 而正确的结果是(3232239450)
echo "\n";
echo sprintf("%u", ip2long($ip)); // 正确输出3232239450, 关于sprintf的使用参考http://www.w3school.com.cn/php/func_string_sprintf.asp
echo "\n";
echo bindec(decbin(ip2long($ip))); // 正确输出 
echo "\n";
echo "\n";
echo "\n";
echo "\n";